СМП_ОнлайнОбменДанными/cfe/src/DataProcessors/ВыгрузкаКонвертации.xml
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>ВыгрузкаКонвертации</name>
  <attributes>
    <name>ИмяФайлаПравил</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ИмяФайлаМодуляВыгрузки</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ИмяФайлаМодуляЗагрузки</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>КонвертацияДляВыгрузки</name>
    <type>
      <types>CatalogRef.СМП_УчетныеЗаписиОбменов</types>
    </type>
  </attributes>
  <attributes>
    <name>РежимСохраненияВерсии</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>1</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СжиматьФайлПравил</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ИмяФайлаОбработчиковВыгрузки</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ИмяФайлаОбработчиковЗагрузки</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>КонвертацияКорреспондентДляВыгрузки</name>
    <type>
      <types>CatalogRef.СМП_УчетныеЗаписиОбменов</types>
    </type>
  </attributes>
  <attributes>
    <name>ВыгружатьПравилаКорреспондента</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>РегистрацияДляВыгрузки</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВыгружатьПравилаРегистрации</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ИмяФайлаПравилКорреспондента</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
</mdclass:DataProcessor>

СМП_ОнлайнОбменДанными/cfe/src/DataProcessors/ВыгрузкаКонвертации/Forms/Форма/Ext/Form/Module.bsl
#Область ОписаниеПеременных

#КонецОбласти

#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Параметры.Свойство("КонвертацияДляВыгрузки", Объект.КонвертацияДляВыгрузки);
	УстановитьДоступностьВидимость(ЭтотОбъект);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ИмяФайлаПравилНачалоВыбора(Элемент, ДанныеВыбора, ВыборДобавлением, СтандартнаяОбработка)
	
	Если Объект.СжиматьФайлПравил Тогда
		Фильтр		= "Архивный файл правил (*.zip)|*.zip";
		Расширение	= "zip";
	Иначе
		Фильтр		= "Файл правил (*.xml)|*.xml";
		Расширение	= "xml";
	КонецЕсли;
	
	ДиалогВыбора = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.Сохранение);
	ДиалогВыбора.Фильтр = Фильтр;
	ДиалогВыбора.Заголовок = НСтр("ru='Выберите имя файла для сохранения правил'; uk='Оберіть ім`я файлу для збереження правил'");
	ДиалогВыбора.Расширение = Расширение;
	Если ЗначениеЗаполнено(Объект.ИмяФайлаПравил) Тогда
		ДиалогВыбора.ПолноеИмяФайла = Объект.ИмяФайлаПравил;
	Иначе
		ДиалогВыбора.ПолноеИмяФайла = "ПравилаОбменаДанными";
	КонецЕсли;
	
	Оповещение = Новый ОписаниеОповещения("ИмяФайлаПравилНачалоВыбораЗавершение", ЭтотОбъект);
	ФайловаяСистемаКлиент.ПоказатьДиалогВыбора(Оповещение, ДиалогВыбора);
	
КонецПроцедуры

// Обработчик оповещения.
//
// Параметры:
//   Стандартные.
//
&НаКлиенте
Процедура ИмяФайлаПравилНачалоВыбораЗавершение(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат <> Неопределено Тогда
		Объект.ИмяФайлаПравил = Результат[0];
	КонецЕсли;
	
КонецПроцедуры //ИмяФайлаПравилНачалоВыбораЗавершение

&НаКлиенте
Процедура СжиматьФайлПравилПриИзменении(Элемент)
	
	Если Объект.СжиматьФайлПравил Тогда
		ИмяФайлаПравил = СтрЗаменить(ИмяФайлаПравил, ".xml", ".zip");
	Иначе
		ИмяФайлаПравил = СтрЗаменить(ИмяФайлаПравил, ".zip", ".xml");
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ВыгружатьПравилаКорреспондентаПриИзменении(Элемент)
	
	УстановитьДоступностьВидимость(ЭтотОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура ИмяФайлаПравилКорреспондентаНачалоВыбора(Элемент, ДанныеВыбора, ВыборДобавлением, СтандартнаяОбработка)
	
	Если Объект.СжиматьФайлПравил Тогда
		Фильтр		= "Архивный файл правил корреспондента (*.zip)|*.zip";
		Расширение	= "zip";
	Иначе
		Фильтр		= "Файл правил корреспондента (*.xml)|*.xml";
		Расширение	= "xml";
	КонецЕсли;
	
	ДиалогВыбора = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.Сохранение);
	ДиалогВыбора.Фильтр = Фильтр;
	ДиалогВыбора.Заголовок = НСтр("ru='Выберите имя файла для сохранения правил корреспондена'; uk='Оберіть ім`я файлу для збереження правил кореспондента'");
	ДиалогВыбора.Расширение = Расширение;
	Если ЗначениеЗаполнено(Объект.ИмяФайлаПравилКорреспондента) Тогда
		ДиалогВыбора.ПолноеИмяФайла = Объект.ИмяФайлаПравилКорреспондента;
	Иначе
		ДиалогВыбора.ПолноеИмяФайла = "ПравилаОбменаДаннымиКорреспондента";
	КонецЕсли;
	
	Оповещение = Новый ОписаниеОповещения("ИмяФайлаПравилКорреспондентаНачалоВыбораЗавершение", ЭтотОбъект);
	ФайловаяСистемаКлиент.ПоказатьДиалогВыбора(Оповещение, ДиалогВыбора);
	
КонецПроцедуры

// Обработчик оповещения.
//
// Параметры:
//   Стандартные
//
&НаКлиенте
Процедура ИмяФайлаПравилКорреспондентаНачалоВыбораЗавершение(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат <> Неопределено Тогда
		Объект.ИмяФайлаПравилКорреспондента = Результат[0];
	КонецЕсли;
	
КонецПроцедуры //ИмяФайлаПравилКорреспондентаНачалоВыбораЗавершение

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура СохранитьФайлы(Команда)
	
	// to do: Блок проверок формы
	ВыгрузитьПравила();
	
	Если ЭтоАдресВременногоХранилища(ПравилаАдресВХ) Тогда
		
		ПолучитьФайлССервераАсинх(ПравилаАдресВХ, Объект.ИмяФайлаПравил);
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// .
//
// Параметры:
//   Нет.
//
&НаСервере
Процедура ВыгрузитьПравила() 
	
	ОбработкаОбъект = РеквизитФормыВЗначение("Объект");
	ОбработкаОбъект.ВыполнитьВыгрузкуПравил(ПравилаАдресВХ);
	ЗначениеВРеквизитФормы(ОбработкаОбъект, "Объект");
	
КонецПроцедуры //ВыгрузитьПравила

// .
//
// Параметры:
//   ФормаОбработки - ФормаКлиентскогоПриложения - форма обработки
//
&НаКлиентеНаСервереБезКонтекста
Процедура УстановитьДоступностьВидимость(ФормаОбработки) 
	
	ФормаОбработки.Элементы.ИмяФайлаПравилКорреспондента.Доступность = ФормаОбработки.Объект.ВыгружатьПравилаКорреспондента;
	
КонецПроцедуры //УстановитьДоступностьВидимость

#КонецОбласти
